Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-faq_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: hooks-faq title: Hooks FAQ permalink: docs/hooks-faq.html prev: hooks-reference.html ---
ja: --- id: hooks-faq title: フックに関するよくある質問 permalink: docs/hooks-faq.html prev: hooks-reference.html ---

source: *Hooks* are a new addition in React 16.8.
ja: *フック (hook)* は React 16.8 で追加された新機能です。

source: They let you use state and other React features without writing a class.
ja: state などの React の機能を、クラスを書かずに使えるようになります。

source: This page answers some of the frequently asked questions about [Hooks](/docs/hooks-overview.html).
ja: このページでは[フック](/docs/hooks-overview.html)に関するよくある質問にいくつかお答えします。

source: * **[Adoption Strategy](#adoption-strategy)**
ja: * **[導入の指針](#adoption-strategy)**

source: * [Which versions of React include Hooks?](#which-versions-of-react-include-hooks)
ja: * [フックが使える React のバージョンはどれですか？](#which-versions-of-react-include-hooks)

source: * [Do I need to rewrite all my class components?](#do-i-need-to-rewrite-all-my-class-components)
ja: * [クラスコンポーネントを全部書き換える必要があるのですか？](#do-i-need-to-rewrite-all-my-class-components)

source: * [What can I do with Hooks that I couldn't with classes?](#what-can-i-do-with-hooks-that-i-couldnt-with-classes)
ja: * [クラスではできず、フックでできるようになることは何ですか？](#what-can-i-do-with-hooks-that-i-couldnt-with-classes)

source: * [How much of my React knowledge stays relevant?](#how-much-of-my-react-knowledge-stays-relevant)
ja: * [これまでの React の知識はどの程度使えますか？](#how-much-of-my-react-knowledge-stays-relevant)

source: * [Should I use Hooks, classes, or a mix of both?](#should-i-use-hooks-classes-or-a-mix-of-both)
ja: * [フック、クラスのいずれを使うべきですか、あるいはその両方でしょうか？](#should-i-use-hooks-classes-or-a-mix-of-both)

source: * [Do Hooks cover all use cases for classes?](#do-hooks-cover-all-use-cases-for-classes)
ja: * [フックはクラスのユースケースのすべてをカバーしていますか？](#do-hooks-cover-all-use-cases-for-classes)

source: * [Do Hooks replace render props and higher-order components?](#do-hooks-replace-render-props-and-higher-order-components)
ja: * [フックはレンダープロップや高階コンポーネントを置き換えるものですか？](#do-hooks-replace-render-props-and-higher-order-components)

source: * [What do Hooks mean for popular APIs like Redux connect() and React Router?](#what-do-hooks-mean-for-popular-apis-like-redux-connect-and-react-router)
ja: * [Redux の connect() や React Router といった人気の API はフックによりどうなりますか？](#what-do-hooks-mean-for-popular-apis-like-redux-connect-and-react-router)

source: * [Do Hooks work with static typing?](#do-hooks-work-with-static-typing)
ja: * [フックは静的型付けと組み合わせてうまく動きますか？](#do-hooks-work-with-static-typing)

source: * [How to test components that use Hooks?](#how-to-test-components-that-use-hooks)
ja: * [フックを使ったコンポーネントはどのようにテストするのですか？](#how-to-test-components-that-use-hooks)

source: * [What exactly do the lint rules enforce?](#what-exactly-do-the-lint-rules-enforce) * **[From Classes to Hooks](#from-classes-to-hooks)**
ja: * [Lint ルールは具体的に何を強制するのですか？](#what-exactly-do-the-lint-rules-enforce) * **[クラスからフックへ](#from-classes-to-hooks)**

source: * [How do lifecycle methods correspond to Hooks?](#how-do-lifecycle-methods-correspond-to-hooks)
ja: * [個々のライフサイクルメソッドはフックとどのように対応するのですか？](#how-do-lifecycle-methods-correspond-to-hooks)

source: * [How can I do data fetching with Hooks?](#how-can-i-do-data-fetching-with-hooks)
ja: * [フックでデータの取得をどのように行うのですか？](#how-can-i-do-data-fetching-with-hooks)

source: * [Is there something like instance variables?](#is-there-something-like-instance-variables)
ja: * [インスタンス変数のようなものはありますか？](#is-there-something-like-instance-variables)

source: * [Should I use one or many state variables?](#should-i-use-one-or-many-state-variables)
ja: * [state 変数は 1 つにすべきですか、たくさん使うべきですか？](#should-i-use-one-or-many-state-variables)

source: * [Can I run an effect only on updates?](#can-i-run-an-effect-only-on-updates)
ja: * [コンポーネントの更新のときだけ副作用を実行することは可能ですか？](#can-i-run-an-effect-only-on-updates)

source: * [How to get the previous props or state?](#how-to-get-the-previous-props-or-state)
ja: * [前回の props や state はどうすれば取得できますか？](#how-to-get-the-previous-props-or-state)

source: * [Why am I seeing stale props or state inside my function?](#why-am-i-seeing-stale-props-or-state-inside-my-function)
ja: * [関数内で古い props や state が見えているのはなぜですか？](#why-am-i-seeing-stale-props-or-state-inside-my-function)

source: * [How do I implement getDerivedStateFromProps?](#how-do-i-implement-getderivedstatefromprops)
ja: * [どうすれば getDerivedStateFromProps を実装できますか？](#how-do-i-implement-getderivedstatefromprops)

source: * [Is there something like forceUpdate?](#is-there-something-like-forceupdate)
ja: * [forceUpdate のようなものはありますか？](#is-there-something-like-forceupdate)

source: * [Can I make a ref to a function component?](#can-i-make-a-ref-to-a-function-component)
ja: * [関数コンポーネントへの ref を作ることは可能ですか？](#can-i-make-a-ref-to-a-function-component)

source: * [How can I measure a DOM node?](#how-can-i-measure-a-dom-node)
ja: * [DOM ノードの位置やサイズの測定はどのように行うのですか？](#how-can-i-measure-a-dom-node)

source: * [What does const [thing, setThing] = useState() mean?](#what-does-const-thing-setthing--usestate-mean) * **[Performance Optimizations](#performance-optimizations)**
ja: * [const [thing, setThing] = useState() というのはどういう意味ですか？](#what-does-const-thing-setthing--usestate-mean) * **[パフォーマンス最適化](#performance-optimizations)**

source: * [Can I skip an effect on updates?](#can-i-skip-an-effect-on-updates)
ja: * [更新時に副作用をスキップすることはできますか？](#can-i-skip-an-effect-on-updates)

source: * [Is it safe to omit functions from the list of dependencies?](#is-it-safe-to-omit-functions-from-the-list-of-dependencies)
ja: * [依存の配列から関数を省略しても大丈夫ですか？](#is-it-safe-to-omit-functions-from-the-list-of-dependencies)

source: * [What can I do if my effect dependencies change too often?](#what-can-i-do-if-my-effect-dependencies-change-too-often)
ja: * [副作用の依存リストが頻繁に変わりすぎる場合はどうすればよいですか？](#what-can-i-do-if-my-effect-dependencies-change-too-often)

source: * [How do I implement shouldComponentUpdate?](#how-do-i-implement-shouldcomponentupdate)
ja: * [どうすれば `shouldComponentUpdate` を実装できますか？](#how-do-i-implement-shouldcomponentupdate)

source: * [How to memoize calculations?](#how-to-memoize-calculations)
ja: * [計算結果のメモ化はどのように行うのですか？](#how-to-memoize-calculations)

source: * [How to create expensive objects lazily?](#how-to-create-expensive-objects-lazily)
ja: * [計算量の大きいオブジェクトの作成を遅延する方法はありますか？](#how-to-create-expensive-objects-lazily)

source: * [Are Hooks slow because of creating functions in render?](#are-hooks-slow-because-of-creating-functions-in-render)
ja: * [レンダー内で関数を作るせいでフックは遅くなるのではないですか？](#are-hooks-slow-because-of-creating-functions-in-render)

source: * [How to avoid passing callbacks down?](#how-to-avoid-passing-callbacks-down)
ja: * [どうすれば複数のコールバックを深く受け渡すのを回避できますか？](#how-to-avoid-passing-callbacks-down)

source: * [How to read an often-changing value from useCallback?](#how-to-read-an-often-changing-value-from-usecallback) * **[Under the Hood](#under-the-hood)**
ja: * [useCallback からの頻繁に変わる値を読み出す方法は？](#how-to-read-an-often-changing-value-from-usecallback) * **[内部の仕組み](#under-the-hood)**

source: * [How does React associate Hook calls with components?](#how-does-react-associate-hook-calls-with-components)
ja: * [React はフック呼び出しとコンポーネントとをどのように関連付けているのですか？](#how-does-react-associate-hook-calls-with-components)

source: * [What is the prior art for Hooks?](#what-is-the-prior-art-for-hooks)
ja: * [フックの先行技術にはどのようなものがありますか？](#what-is-the-prior-art-for-hooks)

source: ## Adoption Strategy {#adoption-strategy}
ja: ## 導入の指針 {#adoption-strategy}

source: ### Which versions of React include Hooks?
ja: ### フックが使える React のバージョンはどれですか？

source: Starting with 16.8.0, React includes a stable implementation of React Hooks for:
ja: React バージョン 16.8.0 より、以下においてフックの安定版の実装が含まれています。

source: Note that **to enable Hooks, all React packages need to be 16.8.0 or higher**.
ja: **フックを利用するには、すべての React のパッケージが 16.8.0 以上である必要があります**。

source: Hooks won't work if you forget to update, for example, React DOM.
ja: 例えば React DOM の更新を忘れた場合、フックは動作しません。

source: [React Native 0.59](https://reactnative.dev/blog/2019/03/12/releasing-react-native-059) and above support Hooks.
ja: React Native は[バージョン 0.59](https://reactnative.dev/blog/2019/03/12/releasing-react-native-059) 以降でフックをサポートします。

source: ### Do I need to rewrite all my class components?
ja: ### クラスコンポーネントを全部書き換える必要があるのですか？

source: No.
ja: いいえ。

source: There are [no plans](/docs/hooks-intro.html#gradual-adoption-strategy) to remove classes from React -- we all need to keep shipping products and can't afford rewrites.
ja: React からクラスを削除する[予定はありません](/docs/hooks-intro.html#gradual-adoption-strategy) -- 我々はみなプロダクトを世に出し続ける必要があり、クラスを書き換えている余裕はありません。

source: We recommend trying Hooks in new code.
ja: 新しいコードでフックを試すことをお勧めします。

source: ### What can I do with Hooks that I couldn't with classes?
ja: ### クラスではできず、フックでできるようになることは何ですか？

source: Hooks offer a powerful and expressive new way to reuse functionality between components.
ja: フックにより、コンポーネント間で機能を再利用するためのパワフルで表現力の高い手段が得られます。

source: ["Building Your Own Hooks"](/docs/hooks-custom.html) provides a glimpse of what's possible.
ja: ["独自フックの作成"](/docs/hooks-custom.html)を読めばできることの概要が掴めるでしょう。

source: [This article](https://medium.com/@dan_abramov/making-sense-of-react-hooks-fdbde8803889) by a React core team member dives deeper into the new capabilities unlocked by Hooks.
ja: React のコアチームメンバーによって書かれた[この記事](https://medium.com/@dan_abramov/making-sense-of-react-hooks-fdbde8803889)により、フックによって新たにもたらされる可能性についての洞察が得られます。

source: ### How much of my React knowledge stays relevant?
ja: ### これまでの React の知識はどの程度使えますか？

source: Hooks are a more direct way to use the React features you already know -- such as state, lifecycle, context, and refs.
ja: フックとは、state やライフサイクル、コンテクストや ref といった、あなたが既に知っている React の機能をより直接的に利用できるようにする手段です。

source: They don't fundamentally change how React works, and your knowledge of components, props, and top-down data flow is just as relevant.
ja: React の動作が根本的に変わるようなものではありませんし、コンポーネントや props、トップダウンのデータの流れについての知識はこれまでと同様に重要です。

source: Hooks do have a learning curve of their own.
ja: もちろんフックにはフックなりの学習曲線があります。

source: If there's something missing in this documentation, [raise an issue](https://github.com/reactjs/reactjs.org/issues/new) and we'll try to help.
ja: このドキュメントに足りないことを見つけたら [Issue を報告](https://github.com/reactjs/reactjs.org/issues/new)していただければ、お手伝いします。

source: ### Should I use Hooks, classes, or a mix of both?
ja: ### フック、クラスのいずれを使うべきですか、あるいはその両方でしょうか？

source: When you're ready, we'd encourage you to start trying Hooks in new components you write.
ja: 準備ができしだい、新しいコンポーネントでフックを試すことをお勧めします。

source: Make sure everyone on your team is on board with using them and familiar with this documentation.
ja: チームの全員の準備が完了し、このドキュメントに馴染んでいることを確かめましょう。

source: We don't recommend rewriting your existing classes to Hooks unless you planned to rewrite them anyway (e.g. to fix bugs).
ja: （例えばバグを直すなどの理由で）何にせよ書き換える予定の場合を除いては、既存のクラスをフックに書き換えることはお勧めしません。

source: You can't use Hooks *inside* a class component, but you can definitely mix classes and function components with Hooks in a single tree.
ja: クラスコンポーネントの*定義内で*フックを使うことはできませんが、クラス型コンポーネントとフックを使った関数コンポーネントとを 1 つのコンポーネントツリー内で混在させることは全く問題ありません。

source: Whether a component is a class or a function that uses Hooks is an implementation detail of that component.
ja: あるコンポーネントがクラスで書かれているかフックを用いた関数で書かれているかというのは、そのコンポーネントの実装の詳細です。

source: In the longer term, we expect Hooks to be the primary way people write React components.
ja: 長期的には、フックが React のコンポーネントを書く際の第一選択となることを期待しています。

source: ### Do Hooks cover all use cases for classes?
ja: ### フックはクラスのユースケースのすべてをカバーしていますか？

source: Our goal is for Hooks to cover all use cases for classes as soon as possible.
ja: 我々の目標はできるだけ早急にフックがすべてのクラスのユースケースをカバーできるようにすることです。

source: There are no Hook equivalents to the uncommon `getSnapshotBeforeUpdate`, `getDerivedStateFromError` and `componentDidCatch` lifecycles yet, but we plan to add them soon.
ja: まだ使用頻度の低い `getSnapshotBeforeUpdate`、`getDerivedStateFromError` および `componentDidCatch` についてはフックでの同等物が存在していませんが、すぐに追加する予定です。

source: It is an early time for Hooks, and some third-party libraries might not be compatible with Hooks at the moment.
ja: まだフックはできたばかりですので、幾つかのサードパーティ製のライブラリは現時点でフックとの互換性がないかもしれません。

source: ### Do Hooks replace render props and higher-order components?
ja: ### フックはレンダープロップや高階コンポーネントを置き換えるものですか？

source: Often, render props and higher-order components render only a single child.
ja: レンダープロップや高階コンポーネントは、ひとつの子だけをレンダーすることがよくあります。

source: We think Hooks are a simpler way to serve this use case.
ja: フックはこのようなユースケースを実現するより簡単な手段だと考えています。

source: There is still a place for both patterns (for example, a virtual scroller component might have a `renderItem` prop, or a visual container component might have its own DOM structure).
ja: これらのパターンには引き続き利用すべき場面があります（例えば、バーチャルスクローラーコンポーネントは `renderItem` プロパティを持つでしょうし、コンテナコンポーネントは自分自身の DOM 構造を有しているでしょう）。

source: But in most cases, Hooks will be sufficient and can help reduce nesting in your tree.
ja: とはいえ大抵の場合ではフックで十分であり、フックがツリーのネストを減らすのに役立つでしょう。

source: ### What do Hooks mean for popular APIs like Redux `connect()` and React Router?
ja: ### Redux の `connect()` や React Router といった人気の API はフックによりどうなりますか？

source: You can continue to use the exact same APIs as you always have; they'll continue to work.
ja: これまでと同様に全く同じ API を使用し続けることができます。それらは動作し続けます。

source: React Redux since v7.1.0 [supports Hooks API](https://react-redux.js.org/api/hooks) and exposes hooks like `useDispatch` or `useSelector`.
ja: React Redux は v7.1.0 より [フック API をサポート](https://react-redux.js.org/api/hooks)しており、`useDispatch` や `useSelector` といったフックを提供しています。

source: React Router [supports hooks](https://reacttraining.com/react-router/web/api/Hooks) since v5.1.
ja: React Router は v5.1 より [フック API をサポート](https://reacttraining.com/react-router/web/api/Hooks) しています。

source: Other libraries might support hooks in the future too.
ja: 他のライブラリも、将来的にフックをサポートするかもしれません。

source: ### Do Hooks work with static typing?
ja: ### フックは静的型付けと組み合わせてうまく動きますか？

source: Hooks were designed with static typing in mind.
ja: フックは静的型付けを念頭に設計されました。

source: Because they're functions, they are easier to type correctly than patterns like higher-order components.
ja: フックは関数ですので、高階コンポーネントのようなパターンと比較しても正しく型付けするのは容易です。

source: The latest Flow and TypeScript React definitions include support for React Hooks.
ja: 最新版の Flow と TypeScript における React の型定義には、React のフックについてのサポートが含まれています。

source: Importantly, custom Hooks give you the power to constrain React API if you'd like to type them more strictly in some way.
ja: 重要なことですが、もしより厳密に型付けしたい場合は、カスタムフックを使うことで React API に何らかの制約を加えることが可能です。

source: React gives you the primitives, but you can combine them in different ways than what we provide out of the box.
ja: React は基本部品を提供しますが、最初から提供されているものと違う方法でそれらを様々に組み合わせることができます。

source: ### How to test components that use Hooks?
ja: ### フックを使ったコンポーネントはどのようにテストするのですか？

source: From React's point of view, a component using Hooks is just a regular component.
ja: React の観点から見れば、フックを使ったコンポーネントは単なる普通のコンポーネントです。

source: If your testing solution doesn't rely on React internals, testing components with Hooks shouldn't be different from how you normally test components.
ja: あなたのテストソリューションが React の内部動作に依存しているのでない場合、フックを使ったコンポーネントのテストのやり方は、あなたが普段コンポーネントをテストしているやり方と変わらないはずです。

source: >Note > >[Testing Recipes](/docs/testing-recipes.html) include many examples that you can copy and paste.
ja: > 補足 > > [テストのレシピ集](/docs/testing-recipes.html)にコピー・ペーストで使えるたくさんの例が掲載されています。

source: For example, let's say we have this counter component:
ja: 例えばこのようなカウンタコンポーネントがあるとしましょう：

source: We'll test it using React DOM. To make sure that the behavior matches what happens in the browser, we'll wrap the code rendering and updating it into [`ReactTestUtils.act()`](/docs/test-utils.html#act) calls:
ja: これを React DOM を使ってテストします。ブラウザでの挙動と確実に合致させるため、これをレンダーしたり更新したりするコードを [`ReactTestUtils.act()`](/docs/test-utils.html#act) でラップします：

source: The calls to `act()` will also flush the effects inside of them.
ja: `act()` を呼び出すと内部の副作用も処理されます。

source: If you need to test a custom Hook, you can do so by creating a component in your test, and using your Hook from it.
ja: カスタムフックをテストしたい場合は、テスト内でコンポーネントを作って中でそのカスタムフックを使うようにしてください。

source: Then you can test the component you wrote.
ja: そうすればそのコンポーネントをテストできます。

source: To reduce the boilerplate, we recommend using [React Testing Library](https://testing-library.com/react) which is designed to encourage writing tests that use your components as the end users do.
ja: ボイラープレートを減らすため、エンドユーザが使うのと同じ形でコンポーネントを使ってテストが記述できるように設計されている、[React Testing Library](https://testing-library.com/react) の利用をお勧めします。

source: For more information, check out [Testing Recipes](/docs/testing-recipes.html).
ja: 詳細については、[テストのレシピ集](/docs/testing-recipes.html)をご覧ください。

source: ### What exactly do the [lint rules](https://www.npmjs.com/package/eslint-plugin-react-hooks) enforce?
ja: ### [Lint ルール](https://www.npmjs.com/package/eslint-plugin-react-hooks)は具体的に何を強制するのですか？

source: We provide an [ESLint plugin](https://www.npmjs.com/package/eslint-plugin-react-hooks) that enforces [rules of Hooks](/docs/hooks-rules.html) to avoid bugs.
ja: 我々は [ESLint プラグイン](https://www.npmjs.com/package/eslint-plugin-react-hooks)を提供しており、これにより[フックのルール](/docs/hooks-rules.html)を強制してバグを減らすことができます。

source: It assumes that any function starting with "`use`" and a capital letter right after it is a Hook.
ja: このルールは、`use` で始まり大文字が続くような名前の関数はすべてフックであると仮定します。

source: We recognize this heuristic isn't perfect and there may be some false positives, but without an ecosystem-wide convention there is just no way to make Hooks work well -- and longer names will discourage people from either adopting Hooks or following the convention.
ja: これは不完全な推測手段であり過剰検出があるかもしれないことは認識していますが、エコシステム全体での規約なくしてはフックはうまく動作しません。また名前を長くするとフックを利用したり規約を守ったりしてくれなくなるでしょう。

source: In particular, the rule enforces that:
ja: 具体的には、このルールは以下を強制します：

source: * Calls to Hooks are either inside a `PascalCase` function (assumed to be a component) or another `useSomething` function (assumed to be a custom Hook).
ja: * フックの呼び出しが `PascalCase` 名の関数内（コンポーネントと見なされます）か、あるいは他の `useSomething` 式の名前の関数内（カスタムフックと見なされます）にあること。

source: * Hooks are called in the same order on every render.
ja: * すべてのレンダー間でフックが同じ順番で呼び出されること。

source: There are a few more heuristics, and they might change over time as we fine-tune the rule to balance finding bugs with avoiding false positives.
ja: これ以外にも幾つかの推測を行っており、また、バグ検出と過剰検出抑制とのバランスを調整していくなかで、これらは将来的に変わる可能性があります。

source: ## From Classes to Hooks {#from-classes-to-hooks}
ja: ## クラスからフックへ {#from-classes-to-hooks}

source: ### How do lifecycle methods correspond to Hooks?
ja: ### 個々のライフサイクルメソッドはフックとどのように対応するのですか？

source: * `constructor`: Function components don't need a constructor.
ja: * `constructor`: 関数コンポーネントはコンストラクタを必要としません。

source: You can initialize the state in the [`useState`](/docs/hooks-reference.html#usestate) call.
ja: state は [`useState`](/docs/hooks-reference.html#usestate) を呼び出すときに初期化します。

source: If computing the initial state is expensive, you can pass a function to `useState`.
ja: 初期 state の計算が高価である場合、`useState` に関数を渡すことができます。

source: * `getDerivedStateFromProps`: Schedule an update [while rendering](#how-do-i-implement-getderivedstatefromprops) instead.
ja: * `getDerivedStateFromProps`: [レンダー中に](#how-do-i-implement-getderivedstatefromprops)更新をスケジューリングします。

source: * `shouldComponentUpdate`: See `React.memo` [below](#how-do-i-implement-shouldcomponentupdate).
ja: * `shouldComponentUpdate`: ページ[下部の](#how-do-i-implement-shouldcomponentupdate) `React.memo` についての説明を参照してください。

source: * `render`: This is the function component body itself.
ja: * `render`: これは関数コンポーネントの本体そのものです。

source: * `componentDidMount`, `componentDidUpdate`, `componentWillUnmount`: The [`useEffect` Hook](/docs/hooks-reference.html#useeffect) can express all combinations of these (including [less](#can-i-skip-an-effect-on-updates) [common](#can-i-run-an-effect-only-on-updates) cases).
ja: * `componentDidMount`, `componentDidUpdate`, `componentWillUnmount`: これらのあらゆる組み合わせは [`useEffect` フック](/docs/hooks-reference.html#useeffect)で表現できます（[これ](#can-i-skip-an-effect-on-updates)や[これ](#can-i-run-an-effect-only-on-updates)のような頻度の低いケースも含め）。

source: * `getSnapshotBeforeUpdate`, `componentDidCatch` and `getDerivedStateFromError`: There are no Hook equivalents for these methods yet, but they will be added soon.
ja: * `getSnapshotBeforeUpdate`、`componentDidCatch` および `getDerivedStateFromError`: フックによる同等物はまだ存在していませんが、近日中に追加される予定です。

source: ### How can I do data fetching with Hooks?
ja: ### フックでデータの取得をどのように行うのですか？

source: Here is a [small demo](https://codesandbox.io/s/jvvkoo8pq3) to get you started.
ja: まずはこちらの[小さなデモ](https://codesandbox.io/s/jvvkoo8pq3)をご覧ください。

source: To learn more, check out [this article](https://www.robinwieruch.de/react-hooks-fetch-data/) about data fetching with Hooks.
ja: フックを使ってデータの取得をする方法について詳しく学ぶには[こちらの記事](https://www.robinwieruch.de/react-hooks-fetch-data/)を参照してください。

source: ### Is there something like instance variables?
ja: ### インスタンス変数のようなものはありますか？

source: Yes!
ja: はい！

source: The [`useRef()`](/docs/hooks-reference.html#useref) Hook isn't just for DOM refs.
ja: [`useRef()`](/docs/hooks-reference.html#useref) フックは DOM への参照を保持するためだけにあるのではありません。

source: The "ref" object is a generic container whose `current` property is mutable and can hold any value, similar to an instance property on a class.
ja: "ref" オブジェクトは汎用のコンテナであり、その `current` プロパティの値は書き換え可能かつどのような値でも保持することができますので、クラスのインスタンス変数と同様に利用できます。

source: You can write to it from inside `useEffect`:
ja: 例えば `useEffect` 内から "ref" オブジェクトを書き換えることができます。

source: If we just wanted to set an interval, we wouldn't need the ref (`id` could be local to the effect), but it's useful if we want to clear the interval from an event handler:
ja: 単にインターバルをセットしたいだけであれば（`id` はこの副作用内でローカルでよいので）この ref は必要ないところですが、もしもイベントハンドラ内でインターバルをクリアしたい場合には便利です：

source: Conceptually, you can think of refs as similar to instance variables in a class.
ja: 概念的には、ref はクラスにおけるインスタンス変数と似たものだと考えることができます。

source: Unless you're doing [lazy initialization](#how-to-create-expensive-objects-lazily), avoid setting refs during rendering -- this can lead to surprising behavior.
ja: [遅延初期化](#how-to-create-expensive-objects-lazily)をしたい場合を除き、レンダーの最中に ref を書き換えることはしないでください。

source: Instead, typically you want to modify refs in event handlers and effects.
ja: その代わり、通常 ref はイベントハンドラや副作用内でだけ書き換えるようにしましょう。

source: ### Should I use one or many state variables?
ja: ### state 変数は 1 つにすべきですか、たくさん使うべきですか？

source: If you're coming from classes, you might be tempted to always call `useState()` once and put all state into a single object.
ja: これまでクラスを使っていたなら、`useState()` を 1 回だけ呼んで、1 つのオブジェクト内にすべての state を入れたくなるかもしれません。

source: You can do it if you'd like.
ja: そうしたければそのようにすることもできます。

source: Here is an example of a component that follows the mouse movement.
ja: 以下はマウスの動作を追跡するコンポーネントの例です。

source: We keep its position and size in the local state:
ja: 位置やサイズの情報を 1 つのローカル state に保持しています。

source: Now let's say we want to write some logic that changes `left` and `top` when the user moves their mouse.
ja: ここで例えば、ユーザがマウスを動かしたときに `left` と `top` を変更したいとしましょう。

source: Note how we have to merge these fields into the previous state object manually:
ja: この際、これらのフィールドを古い state に手動でマージしないといけないことに注意してください：

source: This is because when we update a state variable, we *replace* its value.
ja: これは state 変数を更新する時には変数の値が*置換*されるからです。

source: This is different from `this.setState` in a class, which *merges* the updated fields into the object.
ja: これは更新されるフィールドがオブジェクトに*マージ*されるというクラスでの `this.setState` の挙動とは異なります。
